Revit 2024 API
PointCloudOverrideSettings.SetModeOverride Method
 Sets color settings for the given color mode.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetModeOverride(
	PointCloudColorMode mode,
	PointCloudColorSettings colorSettings
)
Visual Basic
Public Sub SetModeOverride ( _
	mode As PointCloudColorMode, _
	colorSettings As PointCloudColorSettings _
)
Visual C++
public:
void SetModeOverride(
	PointCloudColorMode mode,
	PointCloudColorSettings^ colorSettings
)
Parameters
mode
Type: Autodesk.Revit.DB.PointCloudColorMode
 Color mode for which color settings are set.
colorSettings
Type: Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
 Color settings to be set for the given color mode.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace